#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-Ab5TYD1k6MBmFjNe

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.sample_api_gateway.data.archive_file.function_archive: Refreshing...
module.sample_lambda.data.archive_file.hello-terraform-src: Refreshing...
module.sample_s3_lambda.data.archive_file.source: Refreshing...
module.sample_s3_lambda.data.archive_file.source: Refresh complete after 0s [id=a8eb6da38c7e1d31adc2af363472a1d492c6220a]
module.sample_lambda.data.archive_file.hello-terraform-src: Refresh complete after 0s [id=ae610a8292c758178bd514a9c765786e362f36d9]
module.sample_api_gateway.data.archive_file.function_archive: Refresh complete after 0s [id=041c9899188570a312d7171465c917e45b766b84]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.agencies_api: Refreshing state... [id=8d02jr7iy2]
module.sample_api_gateway.aws_s3_object.file_upload: Refreshing state... [id=tf-lambda-apigw-sample.zip]
module.sample_api_gateway.aws_iam_role.iam_for_lambda_apigw: Refreshing state... [id=iam_lambda_apigw]
module.sample_s3_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_lambda_s3]
module.agencies_api_gateway.aws_api_gateway_rest_api.agencies_api: Refreshing state... [id=5b7w7wsn0h]
module.sample_s3_lambda.aws_s3_object.file_upload: Refreshing state... [id=sample_s3_lambda.zip]
module.s3_bucket.aws_s3_bucket.lambda_bucket: Refreshing state... [id=testing-submodules-resources]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.agencies_api_gateway.aws_iam_role.iam_for_agencies_api_lambda: Refreshing state... [id=iam_for_agencies_api_lambda]
module.sample_api_gateway.aws_api_gateway_rest_api.api_gateway_rest_api: Refreshing state... [id=ips6gacda4]
module.sample_dynamodb_table.aws_dynamodb_table.tf_example_table: Refreshing state... [id=tf-test-table]
module.sample_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.agencies_api_gateway.aws_lambda_function.agencies: Refreshing state... [id=agencies]
module.sample_lambda.aws_lambda_function.hello-terraform: Refreshing state... [id=hello-terraform]
module.agencies_api_gateway.aws_api_gateway_resource.agency_resource: Refreshing state... [id=892zgo]
module.sample_api_gateway.aws_api_gateway_resource.api_gateway: Refreshing state... [id=ryx13w]
module.sample_api_gateway.aws_lambda_function.lamba_apigateway_example: Refreshing state... [id=tf-api-gateway]
module.sample_s3_lambda.aws_lambda_function.lamba_s3_example: Refreshing state... [id=lambdaS3Example]
module.agencies_api_gateway.aws_api_gateway_method.agency_resource_method: Refreshing state... [id=agm-5b7w7wsn0h-892zgo-POST]
module.sample_api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-ips6gacda4-ryx13w-GET]
module.agencies_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.agencies_api_gateway.aws_api_gateway_integration.agencies_lambda_integration: Refreshing state... [id=agi-5b7w7wsn0h-892zgo-POST]
module.sample_api_gateway.aws_lambda_permission.lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sample_api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-ips6gacda4-ryx13w-GET]
module.agencies_api_gateway.aws_api_gateway_deployment.prod_deployment: Refreshing state... [id=arl1m1]
module.agencies_api_gateway.aws_api_gateway_deployment.test_deployment: Refreshing state... [id=97z3vi]
module.sample_api_gateway.aws_api_gateway_deployment.api_gateway_deployment: Refreshing state... [id=st19iv]
module.agencies_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-5b7w7wsn0h-test]
module.agencies_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-5b7w7wsn0h-prod]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.agencies_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.maxfrise_api_gateway.aws_api_gateway_rest_api.agencies_api will be destroyed
  # (because aws_api_gateway_rest_api.agencies_api is not in configuration)
  - resource "aws_api_gateway_rest_api" "agencies_api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-west-2::/restapis/8d02jr7iy2" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2023-06-26T01:10:11Z" -> null
      - description                  = "Api Gateway for agencies management" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-west-2:914036813947:8d02jr7iy2" -> null
      - id                           = "8d02jr7iy2" -> null
      - minimum_compression_size     = -1 -> null
      - name                         = "agencies_api" -> null
      - root_resource_id             = "eowwdtxqy3" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "REGIONAL",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api will be created
  + resource "aws_api_gateway_rest_api" "maxfrise_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Api Gateway for maxfrise"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "maxfrise_api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.sample_api_gateway.aws_lambda_function.lamba_apigateway_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_apigateway_example" {
        id                             = "tf-api-gateway"
      ~ last_modified                  = "2023-06-26T01:10:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "MuixUm9ZYjLsPEuXnJD6vEGUuxxXN3aB91OUYPQBVBU=" -> "kEAx2ezOjpiwEpWHuuN9fML0xIfHTryy2ZVcUoQVnVs="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sample_api_gateway.aws_s3_object.file_upload will be updated in-place
  ~ resource "aws_s3_object" "file_upload" {
      ~ etag                   = "ec75312b1143e7f3263a96954ae3754b" -> "a8526464d17b953ea2af3886c1dd064a"
        id                     = "tf-lambda-apigw-sample.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.sample_lambda.aws_lambda_function.hello-terraform will be updated in-place
  ~ resource "aws_lambda_function" "hello-terraform" {
        id                             = "hello-terraform"
      ~ last_modified                  = "2023-06-11T07:11:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "PYQMfycfRbrnvXKRhiILFatsl1TH1mjESKxeVDQ5I/0=" -> "GyYFFgAgsGEd1xAqyxyocIAjlbQEff5yVO22n74S6zE="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sample_s3_lambda.aws_lambda_function.lamba_s3_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_s3_example" {
        id                             = "lambdaS3Example"
      ~ last_modified                  = "2023-06-26T01:10:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "VUj6B7jsFV5wt2v0Yjg+dhi16Uf377eW2H6yavLwEkg=" -> "8FK6xRtAlXqoSPOU2LiMGxadnPYFgVVtKe9x68MtGzU="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sample_s3_lambda.aws_s3_object.file_upload will be updated in-place
  ~ resource "aws_s3_object" "file_upload" {
      ~ etag                   = "a800f08012c0581f74f036aed5531cc9" -> "f32f16ac00498cb4dad15d59a02a1702"
        id                     = "sample_s3_lambda.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*